# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11-p2 object detection model with P2/4 - P5/32 outputs
# Enhanced version with P2/4 feature layer for better small object detection
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n-p2.yaml' will call yolo11-p2.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: ~350 layers, ~3M parameters, ~7 GFLOPs
  s: [0.50, 0.50, 1024] # summary: ~350 layers, ~10M parameters, ~23 GFLOPs
  m: [0.50, 1.00, 512] # summary: ~440 layers, ~22M parameters, ~70 GFLOPs
  l: [1.00, 1.00, 512] # summary: ~662 layers, ~27M parameters, ~90 GFLOPs
  x: [1.00, 1.50, 512] # summary: ~662 layers, ~60M parameters, ~200 GFLOPs

# YOLO11n-p2 backbone (corrected to match actual YOLO11 structure)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, GatedFFN, [256, False, 1, 0.25]] # 替代C3k2
  - [-1, 1, EOC,  [256, 0.5]] # 替代Conv
  - [-1, 2, GatedFFN, [512, False, 1, 0.25]] # 替代C3k2
  - [-1, 1, EOC,  [512, 0.5]] # 替代Conv
  - [-1, 2, GatedFFN, [512, True, 1, 0.25]] # 替代C3k2
  - [-1, 1, EOC,  [1024, 0.5]] # 替代Conv
  - [-1, 2, GatedFFN, [1024, True, 1, 0.25]] # 替代C3k2
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n-p2 head (enhanced with P2/4 detection)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  # NEW: Add P2/4 feature layer for small object detection
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2
  - [-1, 2, C3k2, [128, False]] # 19 (P2/4-xsmall)

  # Downsample paths
  - [-1, 1, WaveletDownsampleWrapper, [128]]
  - [[-1, 16], 1, Concat, [1]] # cat head P3
  - [-1, 2, C3k2, [256, False]] # 22 (P3/8-small)

  - [-1, 1, WaveletDownsampleWrapper, [256]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 25 (P4/16-medium)

  - [-1, 1, WaveletDownsampleWrapper, [512]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 28 (P5/32-large)

  # Enhanced detection with P2/4 layer
  - [[19, 22, 25, 28], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)